const test_text = `私はその人を常に先生と呼んでいた。だからここでもただ先生と書くだけで本名は打ち明けない。これは世間を憚かる遠慮というよりも、その方が私にとって自然だからである。私はその人の記憶を呼び起すごとに、すぐ「先生」といいたくなる。筆を執っても心持は同じ事である。よそよそしい頭文字などはとても使う気にならない。`
const hayayomi_setu ="hayayomiとは「高速逐次視覚提示」（RSVP）を用いて高速に読書を行う事が出来るアプリケーションです。RSVPとは同じ場所に単語を高速で表示する（フラッシュ暗算のように）事で読書に必要な眼球運動無くし高速に文字を読むことが出来る手法です。ただしこの手法では文字を後戻りする事が出来ず、文章への理解力に影響が出ます。また、適切な速度で読書を行う事でストレスレベル低下につながるため、本アプリケーションではリラックス目的には向いていません。以上より、内容への適切な理解・ストレスレベル低下には役立つ事はありませんが、文章の流し読みや全体の流れの把握に用いる事が出来ます。高速逐次視覚提示に用いる文章の分かち書きはすべてユーザーサイドで行っており、通信を行わないためセキュリティ面でも安全にご利用いただけます。"
const narou = `
　それは何かの予兆を孕んでいた訳でも無ければ、別段非日常的な光景でも無かった。少しだけに通常との差異を挙げるのなら、大学の帰り道に母校の制服を着た男女を見かけた程度。
　男子二人に女子二人、同じ部活にでも所属しているのかすぐ前を歩く四人の高校生は楽しげに会話を行っており、エリートぼっちの俺には眩しい光景だ。特に女子高校生二人はクラストップの美少女と言って良いくらい可愛らしい容姿をしており、一緒に歩いている男子生徒二人が羨ましくもあった。丁度男女比1：1だし、カップル二組なのかもしれない……リア充とか、爆発すればいいのに……

　そう、本当にそんな何でもない帰り道だった。横断歩道の赤信号で止まる四人組の後ろで、数歩分空けて立ち止まり――足元に変な魔法陣みたいなものが現れるまでは――



　なんだコレ？　と感じる前に視界に映る景色がノイズみたいに切り替わる。アスファルトだった筈の地面は石に、鬱陶しさを感じるほどに明るかった昼下がりの日差しは薄暗さを感じるランプ？　の光に……ちょっと待って、意味が分からない。

「ようこそおいで下さいました『勇者様』」

　混乱する以前に、状況すら理解しきれてない耳に鈴のように綺麗な声が聞こえて振り返ると、そこには汚れの欠片すらない白いドレスに身を包み、長い金色の髪と美しい青色の目が印象的な美女が居て、その前に先程見かけた四人組……の内、女子高生二人と男子高校生一人の姿が見えた。あれ？　一人足りなくない？

「突然の事にさぞ――え？」

　金髪の美女は俺達の姿を見て、思わず見とれてしまいそうな微笑みを浮かべながら口を開き……途中で言葉を止めた。
　そして沈黙……状況に置いてけぼりを喰らっている俺や高校生三人は勿論、なにか言いかけていた美女とその周囲に居る時代錯誤なローブ姿の人達も時が止まったように停止し、しばしの静寂が場を支配する。

「……あ、あの、お嬢様？　四人いるように見えるのですが？」
「……奇遇ですねルナ、私にもそう見えます」

　意を決した様にローブ姿の一人が美女に話しかけ、美女もどこか戸惑った様子で言葉を返す。残念なことにまだ俺の思考は、このデンプシーロールの如く叩きつけられる非日常に追いついていない。パソコンなら今砂時計のマークにアイコンが変わっている状態だろう。イン○ル入れとくべきだった……いやいや、何考えてるんだ俺は？

　視線を動かし同じ境遇であろう高校生三人に視線を移すと、そちらもどうやら俺と同じ状態らしくチラリとこちらを見ては戸惑った表情を浮かべている。

「ど、どどど、どうするんですかコレ！？　コレ、アレですよね！　多分三人は『召喚』に巻き込んじゃったとか、そう言うやつですよね！？」
「お、恐らくそうなるかと……どうするんですかお嬢様？」
「どうするも何も『失敗しました。てへっ』じゃ済まないですし、一先ず全員に事情を説明して……ああ、でも、先に勇者様が誰かだけでも判別しないと……」
「てへっ……って、お嬢様。流石にそのご年齢では若作りが過ぎるかと……」
「なんでそこに冷静な突っ込み！？」

　何だろう、この残念な会話。未知の状況への危機感がガリガリ削られていってるような……女子高校生二人もぽかんとした顔してるし、男子高校生も――何でガッツポーズしてるの？　この状況で、ガッツポーズ？
　うん？　待てよ……勇者様？　召喚？　巻き込んだ？　何か聞き覚えのあるような単語が飛び込んでくる気がする。考えろ、なんか最近似たような――

「こほん。改めまして、ようこそおいで――」
「ごめんなさい。ちょっと考え事してるんで、静かにしてくれませんか？」
「あ、はい。申し訳ありません」

　思考を遮るように声が聞こえたので、ちょっと待ってもらうようお願いして考える。ああ、そうか思い出した。ごく最近読んだライトノベルだ！
　あえて公言するほどのものではないが、俺は所謂オタクとかそういう風に呼ばれる趣味を持っている。ゲームが好きで、ライトノベルはそこそこ、アニメは全く見ないと中途半端なオタクではあるけど……ともかく現在の状況は、そのライトノベルの展開にそっくりだ。勇者召喚で異世界に来て、魔王と戦ったりする王道のストーリーで、改めて考えてみると色々な小説で目にした覚えがある。

「……あ、あの……」

　ああ、でも、確か一口に異世界転移物って言っても色々な展開があったような気がする。本当に勇者で魔王と戦う様な物もあれば、実は召喚した王族の方が悪者だったりとか、巻き込まれて無能の烙印を押された一般人が実はチートでしたとか……

「……えっと、あの～……」

　となるとやっぱり今必要なのは情報かな？　いくら事実は小説より奇なりって言葉があるにしても、現段階でここが異世界だなんて決めつける訳にもいかない。けど、明らかに非日常の事態である事は分かってるから、とにかく現状を知らなければならない――あれ？　何か忘れているような？

「……えっと……」
「……え？」

　そこでようやく、困惑と心配が混ざった表情でこちらを見ている金髪の美女の姿が目に入り、急激に意識が思考から現実へと戻ってくる。
　そして意識が現実に戻ると共に、自分が目の前の女性の言葉を遮り思考に没頭していた事を思い出し、血の気が引いてくる。

「……出来れば、そろそろ話を進めたいのですが……よろしいでしょうか？」
「す、すみません！？　ちょっと、昔から考え事すると周囲が目に入らなくなる癖があって……」

　戸惑いがちに告げられた言葉を受け、俺は慌てて頭を下げる。やってしまった……またこの悪い癖が出てしまった。どうにも昔から俺は一つの事に熱中すると周りが見えなくなってしまう癖がある。良く言えば集中力が高いとも言えるが、悪く言えば視野が狭いとも言える。

　ともかくやってしまった。なんか女子高生二人がこちらを見る目も少し呆れたような感じだし、美女の周囲に居るローブの人達も苦笑しているように見える。男子高校生は……なんか下向いてブツブツ言ってる――あ、なんかこの子とは友達になれそう。

「いえ、突然の事に混乱してしまうのも無理はありません。改めまして、異世界の皆様。『シンフォニア王国』へようこそ」

　謝る俺に対して柔らかな笑顔を浮かべた後、美女はスカートの裾を摘むように持って優雅に頭を下げる。そして予想通りと言うか何と言うか、異世界に王国ときた。
　う～んこの気品ある感じに、さっきお嬢様って呼ばれてたって事は貴族？　もしかすると王女様とかかもしれない。

「私はリリア・アルベルトと申します。先ずはいきなりの召喚、申し訳ありません。突然の事に戸惑うかとは思います。先ずはしっかり事情を説明するべきとは理解しております……が、こちら側の都合で恐縮なのですが、説明の前に皆様のお名前をお伺いしてもよろしいでしょうか？」
「……あ、はい。えと……宮間快人です」

　美女――リリアと名乗った女性の質問に、とりあえずの年長者である俺が先に回答する。小説とかだとここで食って掛かる奴が居たり、錯乱して叫ぶような人が居るものだが……実際こうなってみると、混乱と戸惑いが大きすぎて逆に冷静に答えられるものだ。

「……楠葵です」
「……柚木陽菜」
「……光永正義」

　俺に続くように高校生三人も名乗る。てか男子高校生、名前カッコイイな。もう君が勇者で良いよ。永遠の光に正義って、もう勇者になる為に生まれたような名前じゃないか……見た目はどっちかって言うと文系な感じだけどね。

「ミヤマ様にクスノキ様にユズキ様にミツナガ様ですね。よろしくお願いします。では失礼ですが、少しお待ちください」

　そう言いながらリリアさんが先程とは別のローブの人に目配せし、ローブの人が水晶玉のような物を取りだす。何かをするぞとでも言いたげな様子に思わず体が強張るが、リリアさんが慌てた様子で「危害は加えません」と弁明した為、下手に動くのは得策とも思えずその場に留まる……決して異を唱える勇気が無いヘタレと言う訳ではない。

「……どうやら、ミツナガ殿が勇者様として召喚されたようですな。それ以外の方は巻き込まれた形でしょう」
「やはりそうですか」

　どうやら勇者様は光永正義君らしい。予想が当ったと言えば当ったが、これ、マジでどうなるんだろう？　この右も左も分からない状況で、いきなり勇者様とか言われて小さくガッツポーズしてる光永君は凄いよ。君がナンバーワンだ。頑張って面倒事か何かに挑んでくれ。

「では、勇者様への説明はそちらで？」
「ええ、そうさせていただきましょう。リリア様は巻き込まれたお三方への説明をお願いします」

　そんな会話が聞こえてきた後、リリアさんは光永君――勇者様への事情説明とこちらへの説明の内容が異なる為、それぞれ分かれて説明を行うと告げてきた。
　流石にこれには反論した――楠さんと柚木さんが……俺？　俺は別の事で頭がいっぱいでそれどころでは無い。

　正直俺は聖人君子でも何でもないし、己の異常時に見ず知らずの子達の今後を心配できるほど心に余裕がある訳でも無い。目下俺にとって一番重要な問題は……目の前で楠さんと柚木さんをなだめているリリアさん。彼女がどんな人物であり、俺達をどうするつもりなのかと言う事。
　ここまでの印象では腰も低く悪い人物ではないように思えるけど、未だ勇者召喚を行った理由などは説明してないし、彼女がそもそもどういう立ち位置の人物かも分かっていない。

　何でもかんでもライトノベルの展開に照らし合わせるのは間違っているかもしれないけど、この手のストーリーで王族とかが悪者で勇者を奴隷のように使おうとしていたり、勇者以外を冷遇すると言うのは定番中の定番でもある。
　実際現在も勇者である光永君と俺達を分けて説明をすると言っており、どうにも腹に抱えてるものがあるのじゃないかと勘ぐってしまう。

　しかし、悲しいかなそれを裏付ける根拠もこれからの状況を打開する為のヒントも、全て彼女が握っている以上その意向に従わないという選択肢を選ぶ事も出来ない。

「不安に思う気持ちは分かります。ですが決して貴方達に危害を加えたりはしないと、私の名に誓います。こちらの事情と言う勝手極まりない対応ではありますが、どうかお願いします」

　リリアさんがそう言って深く頭を下げた事で、まだ納得はしていない様子ではあったが楠さんと柚木さんの二人も反論の言葉を止め、光永君も静かに頷く。勿論俺も頷いた。
　他の三人も分かっているだろうが、抵抗は恐らく無意味だろう。ざっと人数だけで見てみてもローブ姿の人達は俺達の倍以上の数が居て、更にここは彼女の話を全面的に信じるなら異世界……なにかしら魔法みたいな力があるのは間違いないと思う。
　勿論勇者と呼ばれる光永君には何かしら特別な力があるのかもしれないが、巻き込まれただけの俺にそんなものがあるとも思えない。となればここで己の保身の為に選ぶ選択肢は、話を聞く一択だ。






　リリアさんに案内され薄暗い地下室らしき場所から出ると、豪華な内装の大広間へと辿り着く。どうやら勇者である光永君への説明はここで行われるらしく、どこか聖職者を連想させる白い服に身を包んだ人達と共に彼はこの部屋に残り、俺と女子二人は別室に案内される。
　先程の大広間に比べれば半分以下の大きさの部屋ではあったが十分広く、中世風の内装に大きなテーブルと椅子――ここまでは異世界的な雰囲気は無く、あまり実感はわいてこない。

「どうぞ、ご自由におかけください。ルナ、お三方に何か飲み物を……」
「畏まりました」

　リリアさんが俺達から見て真向かいの席に座り、いつの間にかローブを脱いだルナさんと言うメイド服の女性に指示を出す。先程は薄暗い部屋でフードの付いたローブを着ていた為分からなかったが、ルナさんは肩辺りで切り揃えた水色の髪の女性だった……あったよ、異世界感。
　ルナさんが一礼して部屋から出ていくのを見た後で、俺達も恐る恐る席に座る。まず初めに俺がリリアさん真正面――から少し右にずれた位置に座り、楠さんと柚木さんが俺から二席ほど空けて席に着く。

「先ずは改めて謝罪を、突然別世界にお呼びしてしまい、更にはこちらの都合で説明までに時間をかけてしまい本当に申し訳ありません」
「あ、いえ……」
「その、私達は一体……どうなるんでしょうか？」

　一番気になっていた質問を口にしてくれたのは楠さんだった。長く艶のある黒髪にすらりとした長身、大和撫子と言う言葉が似合いそうな彼女の表情は、俺と比べていくらか落ち着いているように見える。きっと芯の強い女性なのだろう、俺がヘタレとかそういう事は関係なく。

「まず、大前提として我々がミツナガ様を含め貴方達四人に危害を加える事は無いと、我が『アルベルト公爵家』の家名を懸けて誓わせていただきます」
「……アルベルト……公爵家？」
「っと、失礼致しました。私の立場の説明を先に行うべきでしたね。改めて、私の名前はリリア・アルベルト。シンフォニア王国に於いては公爵の爵位を持つ……貴族と言う事になります」
「リリアお嬢様は現国王陛下の腹違いの妹であり、爵位と共に第四位王位継承権を持つお方です。なのでお嬢様が家名を懸けて宣言された先の言葉は、国の総意と受け取って頂いて問題ありません」

　公爵！？　王位継承権！？　予想はしてたけど滅茶苦茶高貴な方だった。

「ちなみにご年齢は22歳であり、15～19歳で結婚するのが一般的なシンフォニア王国に於いて、珍しい独身の公爵様です」
「……ルナ？　何でそんな情報を付け足すんですか？　それ、この場で全く必要ない情報ですよね？」
「いえ、流石にそろそろ『お嬢様』呼びは、無理が出てきたかと思いまして……」
「……ちょっと貴女には後で話があります」

　何だろうこの、見た目凄い高貴な美女で振舞いや口調も丁寧なのに……漂うこの残念な感じは……後、ルナさん結構容赦ない人だなぁ。

「……は、話を戻しますね。先のクスノキ様の疑問への回答を続けますが、恐らく一番ご不安に思われているのは、元の世界に戻れるか否かという点だと思いますが、その点に関してはご安心ください」
「か、帰れるん……ですか？」

　若干怯えの混じった声で問い返すのは、栗色のセミショートヘアから小動物的な可愛らしさを感じる柚木さん。楠さんが怯える柚木さんの手を優しく握っているのと、小柄な身長である事もあってか先輩後輩の関係にも見える。でも胸は柚木さんの方がだいぶ――いやいや、何を考えてるんだ俺は！？

「ええ……ただ、その……」

　柚木さんの言葉を聞いてリリアさんは少し言い辛そうな表情を浮かべる。これは、やっぱりあれか？　魔王的なアレが居て、それを倒さなければ帰れないとかそういうやつだろう。
　そうなってくると、やっぱりリリアさんを信用すべきではないのかも――

「召喚魔法陣が再使用できるまで……一年かかってしまうんです」
「い、一年！？」

　あれ？　何か予想してたのと少し違う気がする。二人は恐らく一年と言う長さに驚いてるんだろうけど、俺も別の意味で驚いている。そう、やけに条件が緩い事に……
　普通こういう展開だと、魔王を倒すまで帰れないとかじゃないのかな？　ああ、ひょっとして光永君の方はそうなのかもしれない。だから一人だけ別に説明を受けてるのかもしれない。
　それに緩いとは言っても一年まったくの神隠し状態と言うのは、元の世界への影響とか考えるとアッサリ納得できるものでも無い。

「……そんな、大会前なのに……」
「陽菜ちゃん、問題はそこじゃなくて……」

　柚木さんって天然なのかな？　むしろこの状況で部活の大会を心配できるって、感心するレベルだよ。

「あ、ご安心ください。『女神様』のお話では、こちらの世界と貴方がたの世界とでは時間の流れが違うらしく、送還を行った際には、この世界へ召喚された直後の時間に戻るそうです。一年と言う期間で成長した体等も、女神様が送還前に戻して下さるので問題はありません」
「……」

　なんか物凄い勢いで不安点が解決されたと思ったら、女神様とかって新しい不明要素が出てきたよ。
　えっとつまり、元の世界に帰るまで一年かかる。けど向こうでの時間経過は心配する必要は無く、こっちの世界で急激に太ったりしても女神様とやらが戻してくれると……

「勿論、お三方がこちらに居る間の身の安全や衣食住は保障します。豪華絢爛とまではいきませんが、不自由の無い生活は私が責任を持って用意します」
「……は、はぁ……」
「えと、あ、ありがとうございます」

　毒気を抜かれると表現すればいいのか、あまりにこちらに有利な情報ばかりが続けざまに放たれ、楠さんと柚木さんも戸惑っている。思わずお礼を言ってしまう程度には……
　しかしまだ油断はできない。そう、光永君の件が解決してないからだ。勇者が魔王と戦う為に召喚されたと言うのであれば、この世界はそれだけ危険な場と言う事。

「……質問をしてもいいですか？」
「勿論ですよ。ミヤマ様」
「えっと、別室で話を聞いている……光永君、でしたね。彼は勇者様と呼ばれていた。と言う事は、魔王みたいな存在が居て、それと戦うって認識で間違いないですか？」

　意を決して俺が尋ねてみる事にする。恐らくここがターニングポイントになる筈だ。リリアさんが正直に話すか誤魔化すか、それで俺自身の身の振り方もある程度方向性が固まる筈。さあ、どう出てくる？
　内心かなりドキドキしながら尋ねた俺に対し、リリアさんもルナさんも……キョトンとした顔で首を傾げる。

「魔王、ですか？　1000年程前に初代勇者様が倒してますよ」
「……へ？　えと、じゃあ魔族とかが人間と敵対してるとか？」
「いえ、人間と魔族は非常に良好な関係ですよ。交流も交易も盛んです」
「……戦争とかは？」
「私が知る限り、ここ800年程は起こってませんね」
「……魔物が溢れかえってるとか？」
「魔物は存在しますが、討伐は冒険者ギルドや騎士団の仕事ですので、ミツナガ様を含め皆さんが戦う必要などありませんよ」
「……」

　あれ？　なんだこの会話？　ちょっと、待って、お願いちょっとだけ考えさせて！？　
　えと、魔王は居ない？　魔族との関係は良好？　戦争は800年起きてない？　魔物は居るけど俺達がどうこうする必要はない？　

「……じゃ、勇者召喚って何の為に？」
「1000年前、正確には1009年前に魔王を倒し、魔族と人間が手を取り合う架け橋となった初代勇者様。その功績を称えつつ今後の平和を願い、10年に1度初代勇者様と同じ異世界から勇者様を招いて大きなお祭りを行っております」
「……お祭り？」
「はい。なのでミツナガ様に関しては、丁度一年後にある『勇者祭』の主役となる為、セレモニー等への参加や各国への訪問も含めて別室にて説明とお願いを行わせて頂いております。勿論本人の意思を尊重しますので、辞退することも可能です」
「あ、辞退とかもあるんですね」
「ええ、過去にも何例か勇者代役を立てて勇者祭を行った事もありますしね。受けていただけた場合は勇者祭までの一年間は国賓扱いとなり非常に高待遇となります。辞退した場合でも生活の保障はしますし、一年この世界を観光して頂いた後でお帰りいただくような形ですね」
「……えと、つまるところ……俺達の今後については……」
「ええ……戸惑う事もあるかと思いますが、異文化とも言えるこの世界を……存分に楽しんでいただき、交流や観光を行ってもらい、10年に1度の世界をあげてのお祭りを体験した後……怪我無く無事に元の世界へお帰りいただきます」
「……」

　拝啓、お母様、お父様――異世界召喚に巻き込まれてしまいました。でも、世界は――平和でした。







　混乱で気付かなかったが、いつの間にかルナさんが入れてくれていた紅茶が目の前にあり、それを一口飲む。
　正直紅茶の味の良し悪しなど分からないが、非日常の事態に遭遇してかなり喉が渇いており非常に美味しく感じた。

「……美味しいハーブティですね」
「お褒めにあずかり光栄です。クスノキ様」

　どうやら紅茶では無くハーブティだったらしい。分からんよそんなお洒落なのは……

「では、説明を再開しましょう。先程申し上げた通り、10年に1度我々はお三方の世界から勇者様を招いております。なので、異世界とこちらの世界の差異に付いてもある程度は把握しておりますので、順を追って説明させて頂きますね」

　成程、確かに1000年前から10年に1度異世界人を招いているのなら、単純計算で100人の異世界人がこの世界へ来た事があると言う事。つまり何を説明するべきかと言うのも、リリアさん達は把握してくれてるって訳か……今回俺達はイレギュラーみたいなもので、勇者への説明とはちょっと違うのかもしれないけど大筋は同じって事かな？

「先ずは1年と言う期間についてですが、この世界の暦は火の月、水の月、木の月、土の月、風の月、光の月と進み、光の月の次は再び火の月から風の月、そして最後に光の月の代わりに天の月があります。日数は一律で30日、1年で360日ですね。ちなみに今日は天の月30日、新年へ切り替わる日です」

　つまり火の月、水の月、木の月、土の月、風の月、光の月、火の月、水の月、木の月、土の月、風の月、天の月って順番で切り替わっていって1年360日。元居た世界と殆ど同じ様な感覚って事で良さそうだ。

「なので皆さんが元の世界に戻れるのは、次の天の月30日ということになります。次に時間ですが、これに関しては全く同じと聞いています。1日は24時間ですね。ここまでで何か質問はありますか？」
「いえ、大丈夫です」
「では次に金銭について。この世界の通貨は1R硬貨、鉄貨、銅貨、銀貨、金貨、白金貨の6種類で、単位はRと呼称します。1R硬貨はそのまま1R、鉄貨が10R、銅貨が100R、銀貨が1000R、金貨が10000R、白金貨が100000Rとなります。国民の一般的な一月の収入は2000から4000Rと言ったところですね」

　て事は前の世界と比べてみると、1Rは100円ぐらいで、それ以下の単位は存在しないって感じかな？　月に銀貨2～3枚、年で金貨4枚位あれば十分生活出来るって感じかな？　うん、大丈夫。まだ頭はついていってる。

「一先ず皆さんには、銀貨50枚――50000Rをお一人ずつに配りますので、観光等で自由にご利用ください。金貨や白金貨は屋台等の単価の安い店では使用できないので、銀貨にしております」
「ぶっ！？」
「「えっ！？」」

　微笑みながら告げるリリアさんの言葉と共に、ルナさんが俺達の前に硬貨の入った綺麗な袋を並べていく。
　50000R、日本円に換算して一人頭500万円ぽんっとくれたぜ、流石公爵様半端ねぇな……

「あ、えと……流石にこれは……」
「少ないと思う気持ちは分かります。突然異世界に召喚された事等を考えても、これでは十分なお詫びにはならないでしょう事も理解しております」
「あ、いや……」

　逆です。多すぎるんです。確かに1年不自由なく生活できる金額ではあるんだろうけど、流石に一介の学生ごときがいきなりこんな大金？　渡されても戸惑いしか……
　いや待て待て、生活費含めてであれば……この世界の生活水準が分からない以上、俺達が元居た世界と同じ様な生活を送るには妥当な金額と言う事なのかもしれない。
　そうだよな、流石に衣食住の保障って言っても、公爵家に住まわせてくれるわけじゃなくて宿を手配してくれるとか、そう言う話なんだよね。

「勿論、衣食住はそれとは別にご用意いたしますし、皆さんには納税義務もありません。そのお金は観光や趣味にお使いください」

　生活費含まずだった！？　じゃあ、やっぱ多すぎる！？

「そ、それだと、流石に多すぎませんか？」

　良く言ってくれた楠さん、そうそれ、俺が言いたかったのはそれだよ。

「クスノキ様、お気遣いは無用です。皆さんを巻き込んでしまった私には、そういった形でしかお詫びのしようがありませんので、どうか使いきるつもりで……足りなければ、その都度追加を用意します」
「ちなみにご用意させて頂いた金銭は、お嬢様の私財ですので遠慮する必要はありません。特にお金のかかる趣味も無く、旦那はおろかその候補すらいない寂しい公爵家当主。貯め込んでいる金額は相当なものですから」
「ルナ、ルナ……何で貴女は、わざわざ私の心をえぐっていくのですか？　貴女私のメイドですよね？」
「ええ、私ルナマリアは、リリアお嬢様に身も心も奉げる事を誓ったメイドであり、いつでもお嬢様の味方です」
「……」

　リリアさんって苦労してるんだな。いや、本当に……後ルナさんの名前は、ルナマリアさんと言うのが正式らしい。覚えておこう。

「さて、お嬢様。婚期を逃した事について気にされる気持ちは分かりますが、そろそろお時間が……」
「私、そういう話一度もしてませんよね！？　貴女が勝手に付け足してるだけですからね！！　っと、それはともかく、確かにこの場で長々と話を続ける訳にもいきませんね。皆さん、この世界の常識等の説明は私の家に移動してからにさせていただきたいのですが……構いませんか？」
「あれ？　ここって、えとリリ――アルベルト公爵様のご自宅ではないのですか？」
「ミヤマ様、リリアとファーストネームで呼んでくださって大丈夫です。敬称も不要ですし、話しやすい口調で構いません」
「あ、えっと、では、リリアさんと呼ばせて頂きます。後、俺も快人と名前……ファーストネームで大丈夫です。敬称も要りません」
「分かりました。では、今後はカイトさんと呼ばせて頂きます。さて、先の質問の件ですが……ええ、ここは勇者召喚を行う神殿で、私の所有宅という訳ではありませんので、長い話は移動してからと致しましょう」

　柔らかく微笑むリリアさんは本当に可憐で、思わず見とれてしまうほど美しかった。う～ん、美人で優しそうで地位もお金もあるのに独身。世の中分からないものだ。
　そしてリリアさんが光永君の方の進展を確認してくると、席を外し室内には俺を含めた3人とルナマリアさんが残される。

「皆様、お茶のお代わりはいかがでしょうか？」
「あ、ありがとうございます。あの、ルナマリアさん？」
「はい。なんでしょうかユズキ様？」
「ぶしつけな質問なんですけど……リリアさんって、凄い美人でスタイルも良くって、その上優しそうなのに……なんで、恋人が……」
「陽菜ちゃん……貴女……」
「あ、いや、ほら先輩も気にはなるでしょ？」

　どうやらリリアさんのお陰で余裕が出てきたのか、柚木さんが俺も気になっていた内容をルナマリアさんに尋ねる。楠さんも強く止めはしないって事は気になってるんだろう。
　そんな俺達の疑問に対し、ルナマリアさんは紅茶を淹れながら苦笑する。

「実は現国王陛下、つまるところお嬢様の兄君様なんですが……歳の離れたリリアお嬢様の事を、それはもう溺愛しておりましてね。ええ、本当に……『リリアお嬢様に男が近付いたら、翌日消える』なんて噂も流れるほどです」
「え、それって……」
「ええ、困ったものです。そのおかげでアルベルト公爵家は使用人含め全員女性で、『本来なら男性の立ち入りは禁止』されてますからね」
「……」

　ちょっと待って、ちょっと何言ってるか分かんないんですけど……つまり国王は重度のシスコン野郎で？　リリアさんの自宅は基本男子禁制で？　以上から導き出される答えは？

「ミヤマ様、おめでとうございます。アルベルト家始まって以来の快挙です。まぁお嬢様の代が初代なんですが……」
「……は？」
「……宮間さん、でしたね？　短い付き合いでした」
「……へ？」
「……日本に帰っても、宮間先輩の事はわすれません」
「……え？　えぇぇぇぇ！？」

　拝啓、お母様、お父様――異世界は平和でした。でも――死亡フラグはちゃんとありました。
`

const segmenter = new TinySegmenter(); // インスタンス生成
text = narou.replace(/\s+/g, '');
console.log(text)
const max_chara = 10
const seg_add = ()=>{
  //確定した分かち書きをひとつ前に足しても規定文字数未満の場合はくっつける
  if(seg.length == 0){
    ;
  }else if(segarray.length == 0){
    segarray.push(seg)
    talk_array.push(current_talk)
  }else if(segarray.slice(-1)[0].length + seg.length < max_chara && segarray.slice(-1)[0] != ""){
    segarray.splice( -1, 1, segarray.slice(-1)[0] + seg)
  }else{
    segarray.push(seg)
    talk_array.push(current_talk)
  }
  seg = ""
}

let segs = segmenter.segment(text);  // 単語の配列が返る
var segarray = []
var talk_array = []
var current_talk = false
let seg = ""
let before_e = ""
segs.forEach(e=>{
  if(e ==""){
    ;
  }else if(["「"].indexOf(e[0]) != -1){
    seg_add()
    current_talk = true
    if(before_e != "」"){
      segarray.push("")
      talk_array.push("-false")
    }
    seg = ""
  }else if(["」"].indexOf(e[0]) != -1){
    seg_add()
    current_talk = false
    segarray.push("")
    talk_array.push("-false")
    seg = ""
  }else if(["て","に","を","は","と","、","。"].indexOf(e) != -1){
    // console.log(e)
    seg += e
    seg_add()
  }else if(["…","!","?","！","？"].indexOf(e) != -1){
    seg += e
    seg_add()
  }else if(seg.length + e.length < max_chara){
    seg += e
  }else{
    seg_add()
    seg = e
  }
  before_e = e
})
